[
    
        {
          "Title": "HEC Balochistan & FATA Undergraduate Scholarship - 2023",
          "Image": "https://jaamiah.com/wp-content/uploads/2021/10/HEC-Scholarships.jpg",
          "Info": "Fully Funded",
          "Description": "<h1 class=\"kt-adv-heading18787_0a3a60-a1 wp-block-kadence-advancedheading\" data-kb-block=\"kb-adv-heading18787_0a3a60-a1\">HEC Balochistan &amp; FATA Undergraduate Scholarship – 2023</h1><p>HEC Balochistan &amp; FATA Undergraduate Scholarship 2023 is a brilliant opportunity for the students of the region to earn a good scholarship. The Higher Education Commission (HEC) is committed to providing educational opportunities for students from Balochistan and FATA. In furtherance of this goal, HEC has recently announced the launch of the Indigenous Scholarships Batch-I for Undergraduate Studies in All Disciplines. HEC Balochistan &amp; FATA undergraduate scholarship2023 program is part of the larger initiative known as “Provision of Higher Education Opportunities for the students of Balochistan &amp; FATA (Phase-III)”, which aims to increase access to higher education for students from these regions.</p>",
          "Scholarship_Details":"<ul><li> Number_of_Scholarships: 500</li><li>   Distribution: Equally among Balochistan and FATA</li> <li> Eligibility_Criteria: <ul><li>Local certificate/domicile from Balochistan or FATA</li><li>Minimum 60% marks in FA/FSc/ICom/ICS/DAE or equivalent</li><li>Age of 22 years or younger</li><li>Possession of required academic qualifications before the closing date</li><li>A-levels & O-levels students must have an equivalence certificate</li><li>Result awaiting students cannot apply</li><li>Not receiving another HEC or government scholarship</li></ul></li> <li> Benefits: <ul><li>Tuition and other fees coverage</li><li>Living, book, and travel allowance</li><li>Initial settlement allowance</li></ul></li></ul>",
          "Eligibility_Criteria":"<ul><strong> To be eligible for the HEC Balochistan & FATA Undergraduate Scholarship 2023, applicants must meet the following criteria:</strong><li>Local certificate/domicile from Balochistan or FATA.</li><li>Completion of 12 years of education with a minimum of 60% marks in FA/FSc/ICom/ICS/DAE or equivalent for an undergraduate degree program.Age of 22 years or younger as of the closing date for undergraduate</li><li> Possession of required academic qualifications before the closing date.</li>   <li>Students with A-levels & O-levels must have an equivalence certificate to apply.</li><li>Result awaiting students cannot apply for scholarships.</li><li>Ineligibility for those already receiving another HEC or government scholarship.</li><li>Students enrolled in medical colleges and engineering programs are not eligible for the reserved seats but may still be considered for the scholarship based on merit.</li><li>Students already enrolled in any bachelor program are encouraged to apply.</li></ul>",
          "How_to_Apply": "<li>Submit an online application through HEC’s website <a href=\"https://www.hec.gov.pk/english/scholarshipsgrants/BAL-FATA/Pages/default.aspx\" target=\"_blank\" rel=\"noopener\">https://www.hec.gov.pk/english/scholarshipsgrants/BAL-FATA/Pages/default.aspx</a></li><li>Pay a PKR 500 application processing fee via the HBL account</li><li>Complete the online application carefully and submit</li><li>HEC reserves the right to postpone or cancel the scholarship process at any time without explanation</li></ul>",
          "Timeline": "Last_Date_to_Submit_Application: February 13, 2023"
        },
       


        {
            "Title": "National Talent Hunt Program 2023, IBA Karachi",
            "Image": "https://jaamiah.com/wp-content/uploads/2019/04/IBA-Karachi.png",
            "Info": "Fully Funded",
            "Description": "National Hunt Training Program, IBA Karachi is a fully funded scholarship program that provides orientation training programs to outstanding students with financial problems. This program is sponsored by Ihsan Trust and IBA Karachi. The students from Baluchistan, KPK, FATA, Sindh, Punjab, and Azad Kashmir can get benefits from this program. However, it is important to remember that it is for talented students who have shown outstanding performance in academics. Hence it is quite competitive as well. The students must prove themselves in entrance exams and interviews. Then they get orientation training to apply to regular degree programs IBA. IBA Karachi has announced NTHP 2023 with the collaboration of Ihsan Trust for deserving talented students throughout the country. It is a merit cum need-based program that trains, grooms, and facilitates selected students. These students may apply conveniently to degree programs offered by IBA and can also apply for financial support. The students who have performed in their matriculation and intermediate examinations can get benefit from NTHP 2023. The Last date for applying is 5th March 2023.",
            "Scholarship_Details": "<ul><li>Program: Orientation training program</li><li>Duration: 2 months</li><li>Subjects_Covered:<ul><li>English Grammar & Composition</li><li>Mathematics</li><li>Presentation & Communication</li></ul></li><li>Benefits:<ul><li>No training fees</li><li>Free study material</li><li>Free living facilities</li><li>Stipend during the training period</li><li>One-sided train/bus ticket</li></ul></li></ul>",
            "Eligibility_Criteria": "<ul><li>Students from all over the country can apply who have secured good marks as under:<ul><li>HSSC-II with 70% and above marks</li><li>HSSC-I with 70% and above marks and will be appearing in HSSC-II exams in 2023</li><li>The students with a year’s gap and who have passed HSSC-I</li><li>Students from the year 2019, and previous than 2019 cannot apply</li><li>Students interested in IBA’s undergraduate degree programs</li></ul></li></ul>",
            "How_to_Apply": "<ul><li>Students can apply online, and it is highly recommended. Online application is available on the website of NTHP &nbsp;<a href=\"https://talenthunt.iba.edu.pk/\" target=\"_blank\" rel=\"noopener\">https://talenthunt.iba.edu.pk/</a></li><li>Students can also apply application by downloading the admission form and submitting it by mail after completing it to</li></ul>",
            "Timeline": "NTHP_Last_Date_of_Submission: March 5, 2023"
        },
          
      
          {
            "Title": "Sindh Talent Hunt Program 2023, IBA Sukkur",
            "Image": "https://jaamiah.com/wp-content/uploads/2022/12/Sukkur-IBA-Logo.png",
            "Info": "Fully Funded",
            "Description": "Sindh Talent Hunt Program is a scholarship program that has been searching for competent and deserving students to support them in getting their undergraduate degrees. IBA Sukkar has been providing academic and research facilities for the selected students. IBA Sukkur is a public university that works under the supervision of the Sindh government. That is why, it is a key partner in STHP every year by conducting entrance exams, evaluating students, and assessing their financial conditions. Thus, providing scholarships to proper candidates under the shadow of STHP. IBA Sukkur has announced admission for STHP 2023 that will eventually offer students the to study a foundation semester free of charge, free books, free hostel accommodation, free pick & drop and with Rs 4000/- as a monthly stipend. It is a merit cum need-based scholarship that will be awarded to 300 students after the entrance exam. The selected students will study English, Mathematics, and Information & Communication Technologies (ICT). The top 100 students will be offered a regular undergraduate degree program with a 100% semester fee waiver. The last date to apply is 7th January 2023.",
            "Scholarship_Details": "<ul><li>Program: Sindh Talent Hunt Program 2023</li><li>Number_of_Scholarships: 300</li><li>Benefits:<ul><li>No tuition fees</li><li>Free Course Books</li><li>Free transportation facility</li><li>Free accommodation facility</li><li>Rs 4000/- as a monthly stipend</li></ul></li></ul>",
            "Eligibility_Criteria": "<ul><li>Completed intermediate in the years 2020, 2021, or 2022</li><li>Domicile in Sindh</li><li>Marks percentage as per the specified criteria</li><li>No supplementary exams were taken in any subject</li><li>Compulsory entrance exam for all students</li></ul>",
            "How_to_Apply": "<ul><li>Submit online application through <a href=\"https://hec.gov.pk/english/scholarshipsgrants/ahbp/overseasscholarships/Pages/default.aspx\" target=\"_blank\" rel=\"noopener\">eportal.hec.gov.pk</a></li><li>Deposit Rs.500/- as application processing fee at Habib Bank limited, in A/C No. 1742-79001334-01</li><li>Keep original Bank payment record/slip safe</li><li>Submit completely filled application online</li></ul>",
            "Timeline": "January 7, 2023"
          },

          {
            "Title": "HEC Law Graduates Scholarships Programme for Balochistan to Study Abroad",
            "Image": "https://jaamiah.com/wp-content/uploads/2021/10/HEC-Scholarships.jpg",
            "Info": "Fully Funded",
            "Description": "The lawyers' community is an essential aspect of the judicial system, and they have a significant role to play in ensuring that justice is served to the general public. The project was started by the Prime Minister in order to replace the void left by the August 2016 blast, which killed a number of high-ranking lawyers.",
            "Scholarship_Details": "<ul><li>Program: Law Graduates Scholarships Programme for Balochistan to Study Abroad</li><li>Eligibility_Criteria:<ul><li>Domicile/Local Certificate of Balochistan Province</li><li>Maximum age as on closing date of applications</li><li>Completed HSSC/Equivalent, LLB and LLM respectively from HEC recognized Universities before the closing date of the applications</li><li>For LLB, Candidates must have completed 12 years of education with at least 50% marks</li><li>For LLM & PhD, Candidates must have completed LLB, LLM respectively from HEC recognized DAIs with at least 50% marks in Bachelor degree</li><li>Minimum 50% Marks (Accumulative Test Score) in Aptitude Test</li><li>Requisite academic qualification acquired on or before the closing date</li><li>Not availing any other scholarship</li></ul></li></ul>",
            "Eligibility_Criteria": "<ul><li>Applicant must possess the Domicile/Local Certificate of Balochistan Province.</li><li>Maximum age as on closing date of applications:</li><ul><li>LLB (5Years): 25 years</li><li>LLM: 30 years</li><li>PhD: 35 years</li></ul><li>For LLB, LLM and PhD scholarships, the candidates must have completed HSSC/Equivalent, LLB and LLM respectively, from HEC recognized Universities before the closing date of the applications.</li><li>For LLB, Candidates must have completed 12 years of education with at least 50% marks in BOI&SE intermediate exam/equivalent.</li><li>For LLM & PhD, Candidates must have completed LLB , LLM respectively from HEC recognized DAIs with at least 50% marks in Bachelor degree.</li><li>Applicant must secure minimum 50% Marks (Accumulative Test Score) in Aptitude Test.</li><li>Applicant must have acquired the requisite academic qualification on or before the closing date.</li><li>Any applicant who is already availing any other scholarship is not eligible to apply.</li></ul>",
            "How_to_Apply": "<ul><li>Submit online application through <a href=\"https://hec.gov.pk/english/scholarshipsgrants/ahbp/overseasscholarships/Pages/default.aspx\" target=\"_blank\" rel=\"noopener\">eportal.hec.gov.pk</a></li><li>Deposit Rs.500/- as application processing fee at Habib Bank limited, in A/C No. 1742-79001334-01</li><li>Keep original Bank payment record/slip safe</li><li>Submit completely filled application online</li></ul>"
          },

          {
            "Title": "USAID-funded Merit and Needs-Based Scholarship Program",
            "Image": "https://jaamiah.com/wp-content/uploads/2021/11/USAID.png",
            "Info": "Fully Funded",
            "Description": "The United States Agency for International Development (USAID) has demonstrated its commitment to supporting Pakistani students who are intellectually capable but lack the financial resources to continue their education. Merit and Needs-Based Scholarship Program (MNBSP) Phase-I has supported scholarships for meritorious but financially disadvantaged students since 2004 to help Pakistan's government improve enrolment in Pakistani universities and achieve international standards. Pakistan's top public and private colleges implemented the first phase at a cost of $10.63 million, awarding 1,807 scholarships in the subjects of Agriculture and Business. Phase-I MNBSP alumni are a diverse group, with many of them being the first in their families to earn a college degree and nearly half of them now providing for their families through well-paying professions.",
            "Scholarship_Details": "<ul><li>Phase: Phase II</li><li>Total_Scholarships: 3000</li><li>Female_Scholarships: 1500</li><li>Affiliated_Universities: 30</li><li>Female_Only_Universities:<ul><li>Lahore College for Women</li><li>Fatima Jinnah Women University</li><li>Sardar Bahadur Khan Women University Quetta</li><li>Shaheed Benazir Bhutto Women University Peshawar</li></ul></li></ul>",
            "Eligibility_Criteria": "<ul><li>Females only, for the Academic Session 2021 in 30 public and private participating institutions</li><li>Master’s/MBA/MS/MPhil/ Education Teaching degree programs in selected disciplines allowed under the scholarship program</li><li>Female students who fulfilled criteria of need and provided all the information sought for under the rules</li></ul>",
            "Financial_Support": "<ul><li>Tuition Fee</li><li>Books</li><li>Boarding & Lodging</li><li>Transportation</li><li>Other Academic Costs</li></ul>",
            "Application_Process": "<ul><li>Applications reviewed by Institutional Scholarship Award Committee (ISAC)</li><li>ISAC recommends candidates to HEC Scholarship Management Committee (SMC)</li><li>Final awardees list forwarded to participating institutions for fund disbursement</li></ul>",
            "How_to_Apply": "<ul><li>Apply through HEC Online Application System</li><li>Submit a printout of application form along with supporting documents to the student financial aid offices of the university</li><li>Do not send hard copy of the application form to HEC</li><li>For more details contact Financial Aid Offices of University</li></ul>"
          },

          {
            "Title": "China-Gwadar: HEC Indigenous Scholarship for Gwadar Students",
            "Image": "https://jaamiah.com/wp-content/uploads/2021/10/HEC-Scholarships.jpg",
            "Info": "Fully Funded",
            "Description": "On behalf of the Government of Pakistan, Higher Education Commission announces the Gwadar Indigenous Scholarship Program. In accordance with Pakistan's commitment to Gwadar's residents. Gwadar's primary goal is to generate skilled, educated, and well-trained young people who are eager to take advantage of the growing employment prospects in China and Pakistan. Uplifting Baluchi youth, in particular, has been made possible through the provision of 4-year BS programs/equivalent MA/MSc degrees at top Punjabi universities, as well as international scholarship opportunities for youth with 14-year or equivalent educational qualifications to study Chinese at top native Chinese language learning institutes or universities in the Chinese native environment. Having a command of the Chinese language, which is the primary medium of communication in the CPEC and its neighbouring projects, will aid them in finding employment.",
            "Scholarship_Details": "<ul><li>Prime_Minister_Announcement:<ul><li>Grant of Rs. 1.000 billion for uplift of Gwadar Town</li><li>Setting up of State of The Art University at Gwadar</li><li>Grant of 50 Scholarships to students from Gwadar for BS (04 Years) equivalent to Master Degree classes in Punjab based universities</li><li>Grant of 50 scholarships to students from Gwadar for learning the Chinese Language in China</li><li>Inclusion of Gwadar district in Prime Minister’s Program for National Health Insurance</li></ul></li></ul>",
            "Eligibility_Criteria":"<ul><li>Applicants must possess Domicile/Local certificate of District Gwadar.</li><li>Must have completed 12 years of formal education with 50% Marks in their FA/FSc/I.Com/ISC/DAE or equivalent.</li><li>Maximum age limit is 22 years as on 10th of September, 2019.</li><li>The pre-requisite qualification must be acquired before the closing date.</li><li>Candidates availing any other HEC/Government scholarship are NOT eligible.</li></ul><p><strong>Important Note:</strong></p><ul><li>Scholarships will be awarded transparently at merit to the Domicile holders of Gwadar only.</li><li>Candidates will be short-listed on the basis of Aptitude Test score and academic credential score (Test will be conducted by HEC).</li><li>Already enrolled students in 4 years bachelor degree program (for the academic year 2019-2020) are strongly encouraged to apply.</li></ul>",
            "How_to_Apply": "<ul><li>Apply through HEC Online Application System</li><li>Submit a printout of application form along with supporting documents to the student financial aid offices of the university</li><li>Do not send hard copy of the application form to HEC</li><li>For more details contact Financial Aid Offices of University</li></ul>"
          },

          
          
                 
          
            
    
          {
            "Title": "OGDCL Need Based Scholarships Program through HEC",
            "Image": "https://jaamiah.com/wp-content/uploads/2021/10/OGDCL-Scholarships.jpg",
            "Info": "Fully Funded",
            "Description": "<div><h1 class=\"kt-adv-heading18787_0a3a60-a1 wp-block-kadence-advancedheading\" data-kb-block=\"kb-adv-heading18787_0a3a60-a1\">OGDCL Need Based Scholarships Program through HEC</h1><p>The Higher Education Commission, in collaboration with the Oil &amp; Gas Development Company Limited (OGDCL), provides scholarships for deserving students to pursue undergraduate and graduate degrees in engineering, business administration, law, archaeology, defense and strategic studies, gender studies, history, sociology, animal sciences, biochemistry, microbiology, electronics, physics, mathematics, information technology, and Pakistan studies at both the undergraduate and graduate levels in these fields. The initiative is aligned with the Higher Education Commission's aims of providing financial assistance to deserving students, increasing access to high-quality education, and encouraging academic interest in disciplines that are critical to Pakistan's economic development. A particular component of the curriculum has been created to help students who come from the OGDCL's operational/concessional district locations.</li></ul></div>",
            "Scholarship_Details":"<br> In order to provide opportunities for access to higher education, the OGDCL-HEC Need-Based Scholarship Program is focused on providing opportunities for access to higher education, particularly to destitute candidates from underprivileged backgrounds who come from operational and concessional areas of OGDCL and who, despite having academic merit, are unable to finance their education. The scholarship covers the cost of tuition, room &amp; board, and books.</p>",
            "Eligibility_Criteria": "<div><p>Only those students who are enrolled in the first semester/professional year in the respective courses offered by the participating institutions are eligible to apply.</p><p><strong>Applicant Eligibility:</strong> Pakistani belonging to operational &amp; concessional districts of Oil &amp; Gas Development Company Limited</p><p><strong>Financial Assistance:</strong> Study at undergraduate &amp; graduate level in the prescribed disciplines at the selected 9 Pakistani universities</p><p><strong>Operational/Concessional Districts List:</strong> <a href=\"https://hec.gov.pk/english/scholarshipsgrants/OGDCL-NBSP/Documents/web2.pdf\" target=\"_blank\" rel=\"noopener\">List of Operational/Concessional Districts</a></p><p><strong>Specific Criteria:</strong></p><ul><li>All scholarships in Quaid-e-Azam University are offered for 02 years Masters’ Programs only.</li><li>All scholarships in International Islamic University Islamabad are offered for Bachelors only.</li><li>All scholarships in Engineering disciplines in various universities are offered for Bachelors only.</li><li>Male and female students have an equal chance of getting selected, students from both genders are highly appreciated to apply. This allocation is especially for those students coming from remote and vulnerable areas of OGDCL Operations / Concessions of Pakistan, who are financially needy and meet admission criteria of the selected 9 partner universities/ degree awarding institution</div>",
            "How_to_Apply": "<div><p>The deserving students can apply online for OGDCL Need-Based Scholarships through HEC by downloading the Application form by clicking the “Apply Now” button below.</p></div>"
        },
                   

        
            {
                "Title": "HEC Scholarships for FATA & Balochistan Students",
                "Image": "https://jaamiah.com/wp-content/uploads/2021/10/HEC-Scholarships.jpg",
                "Info": "Fully Funded",
                "Description": "<div><h1 class=\"kt-adv-heading18787_0a3a60-a1 wp-block-kadence-advancedheading\" data-kb-block=\"kb-adv-heading18787_0a3a60-a1\">HEC Scholarships for FATA &amp; Balochistan Students</h1><p>\"Provision of Higher Education Opportunities for Students of Balochistan and FATA (Phase-II)\" is a programme of the Higher Education Commission (HEC) that offers postgraduate scholarships in various fields.<br> For the award of Scholarships for Postgraduate studies in HEC-recognized public/private sector universities/Degree awarding institutions in Pakistan, applications are invited from deserving candidates who have a Domicile/Local Certificate in Balochistan and the former Federally Administered Tribal Areas (FATA).</p></div>",
                "Scholarship_Details": "<div><p><strong class=\"ms-rteFontSize-2\">Important Note:</strong></p></div> Application_Process: <div><ul><li>Applicants are required to submit applications online through HEC website<strong>&nbsp;&nbsp;</strong></li><li>HEC reserves the right to postpone or cancel the scholarship process at any stage without assigning any reason.</li><li>Scholarships will be awarded on Merit and District Quota.</li><li>Applicants will be short-listed on the basis of Aptitude Test scores (conducted by HEC) and Academic Credentials.</li><li>Applicants have to secure at least 50% marks in the test for securing eligibility.</li><li>The scholarship and reserve seats distribution ratio for the applicants of Balochistan &amp; FATA is 50:50. Placements on reserved seats will be on open merit for selected scholars only. PM&amp;DC minimum eligibility criteria will be applicable.</li><li>Those who are already enrolled in Medical Colleges and Engineering Programs will not be considered against the reserved seats but shall be considered for an offer of scholarships if on Merit.</li><li>Already Enrolled Students in any bachelor program are Encouraged to Apply.</li></ul></div>",
                "Eligibility_Criteria": "<div><ul><li>Applicant must possess Local/Domicile Certificate from Balochistan Province/erstwhile FATA.</li><li>Applicants must have completed 16 years of education with at least 60% marks.</li><li>The maximum age is 35 years as of the <strong>Closing Date.</strong></li><li>Applicants must have acquired the requisite academic qualifications on or before the closing date.</li><li>The Applicants who are already availing of any other HEC/Government scholarship are NOT eligible to apply.</li><li>The Applicants will have to meet HEC and University criteria for admission in MS programs.</li></ul></div>",
                "How_to_Apply": "<div><ul><li>Scholarships will be awarded on merit and&nbsp;District/Agency Quota.</li><li>Candidates will be short-listed on the basis of Aptitude Test (conducted by HEC) score and Academic credentials scores.</li><li>The scholarship distribution ratio for the students of Balochistan &amp; FATA is 50:50.</li></ul></div>"
            },
            {
                "Title": "HEC Undergraduate Scholarship Program Gilgit-Baltistan (GB) Students",
                "Image": "https://jaamiah.com/wp-content/uploads/2021/10/HEC-Scholarships.jpg",
                "Info": "Fully Funded",
                "Description": "<div><p>A scholarship program for Gilgit-Baltistan (GB) students in top public sector Pakistani universities has been established. Providing scholarships to students from the United Kingdom is the primary goal of the programme, which is to prepare young people for the problems they will face in the future. As the terminal point of the CPEC road, Gilgit Baltistan is a strategically vital region, while Gwadar lies at the opposite end of the route's length. The programme will provide financial help to students who choose to pursue higher education at any of Pakistan's best colleges or institutes in order to contribute to the development of their communities and the country as a whole. With the Higher Education Commission (HEC), the United Kingdom's youth can benefit from higher education that is better in terms of its quality, accessibility, affordability, and equity. Because of their geographic proximity to China and central Asian countries, the 14 districts of Great Britain are critically vital for providing learning chances and better work opportunities to the youth of less affluent places.</p></div>",
                "Scholarship_Details": 
                    "<div><p>General eligibility criteria for all these scholarships are as under:</p></div> Application_Process: <div><ul><li>Advertisement in print media and HEC website for inviting the applications of potential candidates.</li><li>HEC Scholarship Aptitude Test shall be arranged by HEC/ETC.&nbsp; Applicants must secure at least 50% marks in the test. The test results will be valid for 01 year.</li><li>Applicants will be short-listed based on Aptitude Test score (conducted by HEC) and Academic Credentials as per the following weightage/Formula:<strong>&nbsp;SSC 10%, HSSC 40% &amp; Scholarship Aptitude Test 50%</strong></li><li>Applications/particulars of shortlisted candidates would be scrutinized in light of the defined eligibility criteria.</li><li>Dropped out seats in a particular year will be adjusted next year.</li><li>Scholarships shall be awarded to the students studying/seeking admission for the BS (4 to 5 years) studies in HEC recognized public sector Universities/Degree Awarding Institutions of Pakistan.</li><li>The selected applicants shall secure admissions by themselves in the defined program of study in Pakistan.</li><li>The scholar shall sign an agreement/undertaking before availing of the scholarship. The terms and conditions laid down in the agreement/undertaking an award letter shall be binding for both parties.</li><li>Final award letters shall be issued after securing the admission and the completion of all required formalities including the legal documents.</li></ul></div>"
                ,
                "Eligibility_Criteria": "<ul><li>The applicants must have a domicile/local certificate of Gilgit-Baltistan.</li><li>The applicants must have completed Secondary School Certificate (SSC) and/or Higher Secondary School Certificate (HSSC) and/or Equivalent, however, priority will be given to those students who have passed/complete their SSC/HSSC or Equal from Gilgit-Baltistan.</li><li>The applicants who are already availing of any other HEC/Government scholarship are NOT eligible to apply.</li><li>Students already enrolled in any BS Program prior to advertisement a maximum of one academic year/session may also apply.</li><li>The award of scholarships will be made irrespective of gender, caste, race, and religion.</li><li>The applicants can apply to any Public Sector university/institution in Pakistan. However, any expenditure over and above the cost given in PC-1 will be borne by the student himself/herself.</li></ul>",
                "How_to_Apply": "<div><p>Apply Here</p></div>"
            }
        ,
        
                    {
                          "Title": "HEC Need Based Scholarships",
                          "Image": "https://jaamiah.com/wp-content/uploads/2021/10/HEC-Scholarships.jpg",
                          "Info": "Fully Funded",
                          "Field1": "<h1 class=\"kt-adv-heading18787_0a3a60-a1 wp-block-kadence-advancedheading\" data-kb-block=\"kb-adv-heading18787_0a3a60-a1\">HEC Need Based Scholarships</h1>",
                          "Description": "<p>Despite the fact that Pakistan has an abundance of talented youth, a lack of resources prohibits them from fulfilling their full potential in a number of areas. When it comes to gaining entry to higher education, this becomes even more difficult. The Government of Pakistan recognises these challenges and has tasked the Higher Education Commission with assisting the most needy and eligible students through Need Based Scholarships. Scholarships for financially disadvantaged students have been announced for as many as 94 public sector colleges and their campuses. The scholarships are intended to improve the socio-economic level of students by providing them with the opportunity to pursue modern education and professional options that will enable them to have a better future.</p>",
                          "Scholarship_Details": "<div><ul><li>Scholarship_Offer: Financial support and scholarships are available for undergraduate studies in any discipline at chosen public sector Pakistani universities and degree granting institutes.</li> <li>Eligibility: Students must compete for admission to the participating university according to the institution’s admission process and be enrolled in Undergraduate (4-year) programmes.</li><li>Application_Process: Interested applicants can obtain the Scholarship Application Form from the Financial Aid Office (FAO) at the participating university. The completed form, along with supporting documents, should be submitted to the FAO for processing.</li></ul></div>",
                          "Eligibility_Criteria": "<ul><li>In order to pursue undergraduate studies in any discipline at chosen public sector Pakistani universities and degree granting institutes, financial support and scholarships are available.</li><li>Students must compete for admission to the participating university according to the institution’s admission process and be enrolled in Undergraduate (4-year) programmes in order to be eligible for the programme.</li><li>The application is also open to students in financial need who are currently enrolled in one of the participating institutions.</li><li>The financial need of a candidate, as determined by the Institutional Scholarship Award Committee, determines his or her candidacy for a scholarship. It will be taken into consideration in this case the financial situation of the applicant’s family members.</li><li>The number of available places will be determined by the participating universities.</li><li>Slots will be funded for the duration of the programme, which means they will be available until the end of the programme. In the event that any students withdraw from the programme, they will be replaced by other candidates on the waitlist.</li><li>All disciplines will remain open. The selected university will determine whether or not to include or omit any discipline based on factors such as the grant amount, programme cost, and number of available spots, among others.</li><li>In the case of Medicine, Pharm-D, and other five-year programmes, financing will be provided throughout the duration of the programme.</li><li>The university may change the overall number of scholarships to some extent in order to fund the tuition fees, taking into account the amount of the grant that has been given.</li><li>Besides tuition, each grantee will receive Rs.6000/- per month in stipend for the duration of the programme, in addition to the tuition price.</li><li>Those students who secure admission on self-finance are not eligible for HEC Need-Based Scholarship Program.</li></ul>",
                          "How_to_Apply": "<ul><li>The Scholarship Application Form can be obtained from the Financial Aid Office (FAO) at the participating university or institution.</li><li>After completion, the Scholarship Form, along with any supporting documents, will be submitted to the same Financial Aid office for processing.</li><li>Students must be admitted to one of the permitted disciplines at one of the participating universities/institutions.</li><li>Funds are not delivered directly to students by the Higher Education Commission; payment is given to the students through university/institutional participation.</li></ul>"
                        },
                        {
                          "Title": "Ehsaas Undergraduate Scholarship Program",
                          "Image": "https://jaamiah.com/wp-content/uploads/2021/06/EHSAS02.png",
                          "Info": "Fully Funded",
                          "Description": "<p>This is the biggest ever needs-based undergraduate scholarship program in Pakistan's history, and it is expected to be the largest in the world. Every year, 50,000 students from low-income households will be given scholarships for 4- to 5-year undergraduate degree programs as part of this initiative, which will be implemented in phases. The scholarship covers the whole tuition price as well as a monthly living allowance of 4,000 in addition to other benefits. In terms of geography, the initiative encompasses all four provinces, as well as AJK and GB.</p>",
                          "Scholarship_Details": "<ul><li><strong>Scholarship Offer:</strong> Fully funded scholarships for 4- to 5-year undergraduate degree programs.</li><li><strong>Coverage:</strong> The scholarship covers the whole tuition price as well as a monthly living allowance of 4,000, in addition to other benefits.</li><li><strong>Geographic Reach:</strong> Encompasses all four provinces, as well as AJK and GB.</li></ul>",
                          "Eligibility_Criteria": "<p>In order to pursue undergraduate studies in any discipline at chosen public sector Pakistani universities and degree-granting institutes, financial support and scholarships are available. Students must compete for admission to the participating university according to the institution’s admission process and be enrolled in undergraduate (4-year) programs in order to be eligible for the program. The application is also open to students in financial need who are currently enrolled in one of the participating institutions.</p><p>The financial need of a candidate, as determined by the Institutional Scholarship Award Committee, determines his or her candidacy for a scholarship. It will be taken into consideration in this case the financial situation of the applicant’s family members. The number of available places will be determined by the participating universities. Slots will be funded for the duration of the program, which means they will be available until the end of the program. In the event that any students withdraw from the program, they will be replaced by other candidates on the waitlist.</p><p>All disciplines will remain open. The selected university will determine whether or not to include or omit any discipline based on factors such as the grant amount, program cost, and number of available spots, among others. In the case of Medicine, Pharm-D, and other five-year programs, financing will be provided throughout the duration of the program.</p><p>The university may change the overall number of scholarships to some extent in order to fund the tuition fees, taking into account the amount of the grant that has been given. Besides tuition, each grantee will receive Rs.6000/- per month in stipend for the duration of the program, in addition to the tuition price. Those students who secure admission on self-finance are not eligible for HEC Need-Based Scholarship Program.</p>",
                          "How_to_Apply": "<ul><li>The Scholarship Application Form can be obtained from the Financial Aid Office (FAO) at the participating university or institution if you are interested in applying for a scholarship. Download the application form by clicking the below “Apply Here” button.</li><li>After completion, the Scholarship Form, along with any supporting documents, will be submitted to the same Financial Aid office (at the university only) for processing. (The HEC will not accept any application forms submitted directly to them.)</li><li>Students must be admitted to one of the permitted disciplines at one of the participating universities/institutions, according to the admission criteria of the respective institution.</li><li>Please keep in mind that this scholarship program will also consider partial scholarships for students who are already enrolled at the designated university/DAI as part of their application.</li><li>Please keep in mind that, under this scholarship program, funds are not delivered directly to students by the Higher Education Commission. University/institutional participation is required in order for payment to be given to the students.</li></ul>"
                        },
                      
                      


    {
            "Title": "State Bank Merit Scholarship -2023 [Employees Only]",
            "Image": "https://jaamiah.com/wp-content/uploads/2021/10/HEC-Scholarships.jpg",
            "Info": "Partially Funded",
            "Description": "The State Bank of Pakistan (SBP) has launched the Merit Scholarship Scheme 2023, offering scholarships to the academically gifted children of its active and retired employees at the OG-2 level. The program provides financial support to deserving and needy students pursuing education at the Intermediate, Graduate, and Post Graduate levels. Eligible students pursuing Intermediate, Graduation, Post-Graduation, and diploma courses (minimum 6 months) in any discipline may apply for the SBP Merit Scholarship. The last date to submit applications is 20th February 2023.",
            "Scholarship_Details":"<ul><li>The State Bank of Pakistan Merit Scholarship program is for the children of its employees, both current and retired, who are working at the OG-2 level.</li><li>It provides financial support to students pursuing education at the Intermediate, Graduate, and Post Graduate levels in any discipline.</li><li>The scholarship is awarded based on academic merit and is open to students enrolled in courses with a minimum duration of 6 months.</li><li>The offered scholarships to awarded students are as follows:</li><ul><li><strong>Intermediate Program:</strong></li><ul><li>Last Qualification: Matric/O-Levels</li><li>Scholarship Amount: Rs 7,330/-</li></ul><li><strong>Graduation Program:</strong></li><ul><li>Last Qualification: Intermediate/A-Levels</li><li>Scholarship Amount: Rs 9,330/-</li></ul><li><strong>Postgraduation Program:</strong></li><ul><li>Last Qualification: Graduation</li><li>Scholarship Amount: Rs 13,328/-</li></ul></ul></ul>",
            "Eligibility_Criteria": "<ul><li>Children of current or retired SBP employees, or deceased employees, at OG Level 2.</li>li>Obtained a minimum of 60% marks or B grade in Matriculation, Intermediate, Graduation, or diploma courses.</li><li>GPA/CGPA grades must be accompanied by a certificate from the institution indicating the grading policy with equivalent percentage marks.</li><li>Enrolled in an educational institution during or after 2021.</li><li>Not receiving any other scholarship.</li><li>Minimum duration of 6 months for diploma courses.</li><li>Course duration must be mentioned in the application form.</li></ul>",
            "How_to_Apply": "The State Bank of Pakistan Merit Scholarship application process involves the following steps:\n1. Download the application form.\n2. Fill out the application form completely and accurately.\n3. Deadline for submission is February 20, 2023.\n4. Submit the application form to Mr. Amjad Ali, Senior Joint Director of the Human Resources Department, State Bank of Pakistan, II Chundrigar Road, Karachi."
            
        },
      {
        "Title": "Khairpur Need Cum Merit-Based Scholarship 2023",
        "Image": "https://jaamiah.com/wp-content/uploads/2023/01/sindgovtlogo.png",
        "Info": "Partially Funded",
        "Description": "The Khairpur District Administration is offering a merit-based scholarship for students from Khairpur who are currently studying in public-sector Institutes/colleges and universities in Pakistan, preferably those recognized by the Higher Education Commission. To be eligible for the scholarship, students must be residents of Khairpur and meet the required criteria. Applications for the scholarship must be submitted within one month of the announcement, which was made on December 20, 2023. The deadline for submitting applications is January 21, 2023.",
          "Scholarship_Details": ["Khairpur Need cum Merit-based scholarship 2023 has been announced by the local administration for the male and female students of the Khairpur District. The students can avail of this scholarship to study in public sector educational Institutes/ degree colleges/ Universities. Students, who have taken admissions in public sector educational institutes, can apply for this scholarship. The selected students will get full financial coverage against their educational expenses.At least 10% of the scholarships have been reserved for female students, 1% for minorities, and 5% for individuals with disabilities. However, if there are any remaining open slots after these minimum percentages are filled, they will be available for students selected based on open merit. The scholarship funds will be disbursed online to the bank accounts of eligible and qualified students, as listed in their application forms."],
          "Eligibility_Criteria": "<ul><li>Candidates and their fathers or guardians must have a Domicile and Permanent Resident Certificate (PRC) from the Khairpur District.</li><li>Candidates must have achieved a minimum of 75% marks in their last examination passed.</li><li>Only marks certificates from the last examination taken, no earlier than 2019, will be accepted.</li><li>Students who are studying in public sector universities or colleges for the above-mentioned courses on a self-financing basis are not eligible for this scholarship.</li><li>Students of MS/MPhil/ME/LLM/Ph.D. are not eligible for this scholarship.</li></ul>",
          "How_to_Apply": "<ul>To apply for the scholarship, candidates must obtain a scholarship application form from the Scholarship Cell at the Office of the Deputy Commissioner/Chairman Need-Cum-Merit Scholarship Board in Khairpur or download it from the website or Facebook page. Only application forms for 2022-23 will be accepted. Along with the completed application form, candidates must also submit:<li> Copy of CNIC of applicant and father/guardian.</li><li>Attested copies of all educational documents.</li><li>Domicile and Permanent Residence Certificate (PRC) of the Khairpur District.</li><li>Fresh and verified course enrollment certificate.</li><li>Fresh and verified income certificate of father/guardian (from BPS-1 to 16).</li><ul>"
        }
      

]